<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class SuthepController extends Controller
{
    function index() {
      $topic_name = [
        'box-plants', 'box-animals', 'box-fungus', 'box-geology', 'box-culture'
      ];
			$data_topic = [
        [
          'topic' => 'plants',
          'detail' => '&nbsp &nbsp &nbsp &nbsp สังคมพืชในพื้นที่อุทยานแห่งชาติดอยสุเทพ-ปุยสามารถจำแนกออกเป็น 4 ประเภท ได้แก่ <b>ป่าเต็งรัง</b>  พบกระจายอยู่บริเวณรอบ ๆ ชายขอบของอุทยานฯ พืชพรรณส่วนใหญ่ประกอบด้วย เต็ง รัง เหียง พลวง พะยอม <b>ป่าเบญจพรรณ</b> มีไผ่ชนิดต่าง ๆ ขึ้นปะปนอยู่หลายชนิด พืชพรรณประกอบด้วย สัก ตะแบก ประดู่ <b> ป่าดิบแล้ง </b> พบกระจาย ตามบริเวณหุบเขา บริเวณต้นน้ำลำธาร เช่น บริเวณน้ำตกมณฑาธาร น้ำตกสันป่ายาง และห้วยแม่ลวด ฯลฯ ชนิดไม้ที่สำคัญได้แก่ ยางแดง ยางนา ตะเคียนทอง ก่อเดือย ก่อแดง มะไฟป่า เสี้ยวป่าดอกขาว <b>ป่าดิบเขา</b> พรรณไม้เด่นที่สำคัญได้แก่ ก่อแป้น ก่อเลือด ก่อนก มณฑาหลวง จำปีป่า สารภีดอย กำลังเสือโคร่ง ',
        ],
        [
          'topic' => 'animals',
          'detail' => '&nbsp &nbsp &nbsp &nbsp สังคมพืชในพื้นที่อุทยานแห่งชาติดอยสุเทพ-ปุยสามารถจำแนกออกเป็น 4 ประเภท ได้แก่ <b>ป่าเต็งรัง</b>  พบกระจายอยู่บริเวณรอบ ๆ ชายขอบของอุทยานฯ พืชพรรณส่วนใหญ่ประกอบด้วย เต็ง รัง เหียง พลวง พะยอม <b>ป่าเบญจพรรณ</b> มีไผ่ชนิดต่าง ๆ ขึ้นปะปนอยู่หลายชนิด พืชพรรณประกอบด้วย สัก ตะแบก ประดู่ <b> ป่าดิบแล้ง </b> พบกระจาย ตามบริเวณหุบเขา บริเวณต้นน้ำลำธาร เช่น บริเวณน้ำตกมณฑาธาร น้ำตกสันป่ายาง และห้วยแม่ลวด ฯลฯ ชนิดไม้ที่สำคัญได้แก่ ยางแดง ยางนา ตะเคียนทอง ก่อเดือย ก่อแดง มะไฟป่า เสี้ยวป่าดอกขาว <b>ป่าดิบเขา</b> พรรณไม้เด่นที่สำคัญได้แก่ ก่อแป้น ก่อเลือด ก่อนก มณฑาหลวง จำปีป่า สารภีดอย กำลังเสือโคร่ง ',
        ],
        [
          'topic' => 'fungus',
          'detail' => '&nbsp &nbsp &nbsp &nbsp สังคมพืชในพื้นที่อุทยานแห่งชาติดอยสุเทพ-ปุยสามารถจำแนกออกเป็น 4 ประเภท ได้แก่ <b>ป่าเต็งรัง</b>  พบกระจายอยู่บริเวณรอบ ๆ ชายขอบของอุทยานฯ พืชพรรณส่วนใหญ่ประกอบด้วย เต็ง รัง เหียง พลวง พะยอม <b>ป่าเบญจพรรณ</b> มีไผ่ชนิดต่าง ๆ ขึ้นปะปนอยู่หลายชนิด พืชพรรณประกอบด้วย สัก ตะแบก ประดู่ <b> ป่าดิบแล้ง </b> พบกระจาย ตามบริเวณหุบเขา บริเวณต้นน้ำลำธาร เช่น บริเวณน้ำตกมณฑาธาร น้ำตกสันป่ายาง และห้วยแม่ลวด ฯลฯ ชนิดไม้ที่สำคัญได้แก่ ยางแดง ยางนา ตะเคียนทอง ก่อเดือย ก่อแดง มะไฟป่า เสี้ยวป่าดอกขาว <b>ป่าดิบเขา</b> พรรณไม้เด่นที่สำคัญได้แก่ ก่อแป้น ก่อเลือด ก่อนก มณฑาหลวง จำปีป่า สารภีดอย กำลังเสือโคร่ง ',
        ],
        [
          'topic' => 'geology',
          'detail' => '&nbsp &nbsp &nbsp &nbsp สังคมพืชในพื้นที่อุทยานแห่งชาติดอยสุเทพ-ปุยสามารถจำแนกออกเป็น 4 ประเภท ได้แก่ <b>ป่าเต็งรัง</b>  พบกระจายอยู่บริเวณรอบ ๆ ชายขอบของอุทยานฯ พืชพรรณส่วนใหญ่ประกอบด้วย เต็ง รัง เหียง พลวง พะยอม <b>ป่าเบญจพรรณ</b> มีไผ่ชนิดต่าง ๆ ขึ้นปะปนอยู่หลายชนิด พืชพรรณประกอบด้วย สัก ตะแบก ประดู่ <b> ป่าดิบแล้ง </b> พบกระจาย ตามบริเวณหุบเขา บริเวณต้นน้ำลำธาร เช่น บริเวณน้ำตกมณฑาธาร น้ำตกสันป่ายาง และห้วยแม่ลวด ฯลฯ ชนิดไม้ที่สำคัญได้แก่ ยางแดง ยางนา ตะเคียนทอง ก่อเดือย ก่อแดง มะไฟป่า เสี้ยวป่าดอกขาว <b>ป่าดิบเขา</b> พรรณไม้เด่นที่สำคัญได้แก่ ก่อแป้น ก่อเลือด ก่อนก มณฑาหลวง จำปีป่า สารภีดอย กำลังเสือโคร่ง ',
        ],

        [
          'topic' => 'culture',
          'detail' => '&nbsp &nbsp &nbsp &nbsp สังคมพืชในพื้นที่อุทยานแห่งชาติดอยสุเทพ-ปุยสามารถจำแนกออกเป็น 4 ประเภท ได้แก่ <b>ป่าเต็งรัง</b>  พบกระจายอยู่บริเวณรอบ ๆ ชายขอบของอุทยานฯ พืชพรรณส่วนใหญ่ประกอบด้วย เต็ง รัง เหียง พลวง พะยอม <b>ป่าเบญจพรรณ</b> มีไผ่ชนิดต่าง ๆ ขึ้นปะปนอยู่หลายชนิด พืชพรรณประกอบด้วย สัก ตะแบก ประดู่ <b> ป่าดิบแล้ง </b> พบกระจาย ตามบริเวณหุบเขา บริเวณต้นน้ำลำธาร เช่น บริเวณน้ำตกมณฑาธาร น้ำตกสันป่ายาง และห้วยแม่ลวด ฯลฯ ชนิดไม้ที่สำคัญได้แก่ ยางแดง ยางนา ตะเคียนทอง ก่อเดือย ก่อแดง มะไฟป่า เสี้ยวป่าดอกขาว <b>ป่าดิบเขา</b> พรรณไม้เด่นที่สำคัญได้แก่ ก่อแป้น ก่อเลือด ก่อนก มณฑาหลวง จำปีป่า สารภีดอย กำลังเสือโคร่ง ',
        ],
      ];
		return view('suthep', compact('data_topic', 'topic_name'));
	}
}
